city4postdict = {}
city4postedit = {}
ctrl_citydict = {}
ex_city = {}
post4edit = []
city4postdelete = {}

Tabligh = "رباتساز تکجوی @takjoyBot هر روز با ایده های جدید در خدمت شما است و در جهت رضایتمندی شما عزیزان از انتقادات، پشنهادات و  از ایده های شما استقبال می کنیم. 🎁"
post_edition = "لطفا شهر موردنظر خود را جهت ویرایش انتخاب کنید."
post_deletion = "کدوم شهر را می‌خواهید حذف کنید؟"
give_city_name = "لطفا نام شهر را بنویسید"
give_purchaseofcity = "لطفا مبلغ مورد نظر را جهت دریافت هزینه پستی این شهر به تومان بنویسید. مثلا بنویسید: ۱۰۰۰"
purchase_added = "شهر و مبلغ مربوطه اضافه شد."
post_edition_cancelled = "لغو شد"
post_not_exists = "شما قبلا شهری را اضافه نکرده‌اید."
give_new_city_name = "لطفا نام جدید شهر را بنویسید."
city_deleted_successfully = "نام شهر با موفقیت حذف شد."
cancelled = "انصراف از ادامه... \n"
