account_dict = {}
account_number_dict = {}
list4seller = []

give_number_account = "لطفا شماره حساب/شماره کارت خود را وارد نمایید."
give_account_owner_name = "لطفا نام صاحب حساب را بنویسید."
account_saved = "شماره حساب شما با موفقیت ذخیره شد."
account_deletion_cancelled = "حذف شماره حساب انجام نشد."
you_have_no_account_number = "شما هیچ شماره حسابی را تا کنون ذخیره نکرده‌اید. 😉"
account_deleted = "شماره حساب شما با موفقیت حذف شد. ☺️"
give_account4deletion = "شماره حساب/شماره کارتی که قصد حذف آن را دارید، انتخاب کنید."
Tabligh = "رباتساز تکجوی @takjoyBot هر روز با ایده های جدید در خدمت شما است و در جهت رضایتمندی شما عزیزان از انتقادات، پشنهادات و  از ایده های شما استقبال می کنیم. 🎁"
choose_account_setting = "جهت اضافه کردن شماره حساب/شماره کارت بر روی افزودن و جهت حذف شماره کارت، بر روی حذف کلیک کنید."
