#BOT = {}
#bot_dict ={}
dic_user_id = {}
dic_first_button = {}
dic_secound_button = {}
owner_stage = {}
dic_context = {}
dic_title = {}
dic_currency_ware = {}
dic_unit_ware = {}
dic_price_ware = {}
dic_discount = {}
dic_photo_file = {}
file_id = {}
showindays = {}
message_with_inline_keyboard = {}
day_code = {}
seller_dict = {}
dict_citypost = {}
purchase_citypost = {}
customer_order_characteristic = {}
user_id4owner = {}
dic_user_id = {}
dic_user_name = {}
dic_first_name = {}
dic_last_name = {}
dic_Address = {}
dic_Phone_Number = {}
dic4charge_bot_id2token = {}
Date_bot = {}
dict4bot_ids4users = {}
dict_token2e_num = {}
#TOKEN2my_number = {}
user_id_owner = {}

show41keys = []
Flag_Seller_Dict = []
user_in_setting = []
close_store = []
seller_const4show = []
ctrl_context_list = []
token_takjoy_bot = []
flag4mine = []
list_bot_id = []
tasks = []
list4customer_chars = [dic_user_name, dic_first_name, dic_last_name, dic_Address, dic_Phone_Number]
my_user_ids = [132684196]
day4code = {"شنبه":2 ,"یکشنبه":1 , "دوشنبه":64 , "سه شنبه":32 ,"چهارشنبه":16 ,"پنجشنبه":8 ,"جمعه":4}
num4dayList = [64, 32, 16, 8, 4, 2, 1]
nameOFdaylist = ["دوشنبه","سه شنبه","چهارشنبه","پنجشنبه","جمعه","شنبه","یکشنبه"]
BoxList = ["title","context","currency_ware","price_ware","unit_ware","discount","photo_file","file_id"]
canotuse4title = ["درباره رباتساز 🤖", "بازگشت", "انصراف", "خروج"]

Start_New_Bot = "لطفاً جهت شروع تنظیمات ساخت ربات بر روی تنظیمات ⚙ کلیک نمایید."
Tabligh = "رباتساز تکجوی @takjoyBot هر روز با ایده های جدید در خدمت شما است و در جهت رضایتمندی شما عزیزان از انتقادات، پشنهادات و  از ایده های شما استقبال می کنیم. 🎁"

robot_presentation = " در این رباتساز ابتدا بایستی توکن و سپس یوزرنیم ربات خود را معرفی نمایید. \n یوزرنیم ربات شما باید بصورت @***** باشد. \n\n"
robot_presentation2 =  "چنانچه قبلا ربات خود را ساخته و توکن آن را در اختیار رباتساز دیگری قرار داده اید، ابتدا در @Botfather با دستور /revoke توکن خود را تغییر دهید و سپس توکن تغییر یافته را بنویسید. \n\n"
robot_presentation3 = "جهت مشاهده نحوه ایجاد توکن و یا تغییر آن به کانال @takjoy مراجعه فرمایید. \n"
Error_title_reserved = "نام انتخابی یکی از کلمات رزورو شده است و قبول نمی کنیم."
keyislonger = "این دیگه شاه کلیده، کلید نیست که! 😂 \n یه کلید بنویس جاش بشه. یکی دو کلمه خیلی کوتاه کافیه.🔑 \n"
witch_portion_edit = "کدام قسمت را می‌خواهید ویرایش کنید؟"
no_bot = "شما رباتی ندارید.\n اول توکن یه ربات رو بفرست، بعد اگه مشکلی بود توکن رو تغییر بده.\n برای فرستادن توکن دکمه‌ای نیست، توکن رو همینجوری بفرست"
botmaker_works = "رباتساز درست کار می‌کنه. ثانیه: {sec} و دقیقه: {mine}"
result1= "نام دکمه اول:\n"
result12= "نام دکمه کلی:\n"
result2 = "\n" + "لطفا زیردکمه دوم از این دکمه را بنویسید"

give_title = ("""لطفا اسم یا کد جنس خود را بنویسید. \n\n
هر زمان  مشتری این جنس را سفارش می دهد، فقط اسم جنس را برای شما می فرستیم. بنابراین اسم تکراری قبول نمی کنیم. \n\n
اسمی را بنویسید که قبلا به عنوان اسم کالای دیگه انتخاب نکرده باشید. \n\n یه سری کلمات هم رزرو شده اند که نمی تونی انتخاب کنی. «درباره رباتساز 🤖»، «بازگشت»، «انصراف» و «خروج» از این دسته کلمات هستند.""")

title_repetetive = "نام کالا تکراری است. نام کالای تکراری مورد پذیرش نیست. 😁\n\n لطفا نامی را برای کالای خود انتخاب کنید که تا کنون در این فروشگاه به عنوان نام کالای دیگر انتخاب نکرده باشید. 😉"

give_context = "لطفا متن مربوط به این کالا را بنویسید. 📃\n اگه متن خیلی طولانی باشه، مشتری حوصله خوندن متن طولانی رو نداره. 😴\n"

give_photo_ware = "لطفا عکس مربوط به جنس خود را وارد نمایید. 📸"

give_price_ware = "لطفا قیمت جنس خود را بر حسب تومان بنویسید. 💵"

give_currency_ware = "این قیمت به ریال است یا به تومان؟"

mistake_price_ware = "خطا در ورود اطلاعات. لطفا قیمت جنس را بنویسید 😐"

give_unit_ware = "لطفا واحد شمارش جنس را وارد کنید. مثلا پرس، کیلوگرم، عدد یا ..."

mistake_unit_ware = "لطفا بدرستی مشخص نمایید این قیمت به ریال است یا به تومان؟ "

mistake_discount = "لطفا درصد تخفیف را درست بنویسید"

give_discount = "چنانچه به این جنس تخفیف داده می شود، درصد آن را مشخص کنید"

give_result_ware = "نتیجه نهایی:"

give_amendment = "لطفا موارد اصلاحی را مشخص کنید: 💇"

saved_in_db = "تنظیمات شما با موفقیت ذخیره شد. 🗄"

give_next_ware = " در صورت نیاز، شروع به ثبت کالای جدید نمایید."

daysetting4what = "در این قسمت قراره مشخص کنید این کالا/جنس چه روزهایی به مشتری نشون داده بشه و چه روزهایی نشون داده نشه. 📅\n"

give_day_setting = "فروش محصول در روزهای:"

store_setting_message = "لطفا تنظیمات مربوط به فروشگاه را وارد نمایید. "

store_closed = "فروشگاه تعطیل است 🔒."

isproductokornot = "لطفا جهت ثبت کالا بر روی دکمه تایید ✅ کلیک نمایید و در صورتی که نیاز به اصلاح کالا است، بر روی اصلاح کلیک کنید. 💇"

Error_title = "بابا دمت گرم. چه اسم طویل و درازی. 🤔 \n اسمش این باشه آیا متنش چیه؟! 😳 \n اسم کالا رو چند کلمه کوچیک انتخاب کن. اینو من قبول نمی کنم."

Error_context = "کتاب داستان می نویسی؟ 📚 \n متن شما خیلی بلنده. 😳 \n اینو من قبول نمی کنم. خلاصه تر بنویس."

Error_price = "هنگ کردم. 😳 \n اجناس با قیمت نجومی می فروشی! 💰 کارت خیلی درسته. \n شرمنده، من جنس به این گرونی رو قبول نمی کنم. ارزون تر کن و رقم جدید رو بنویس."

bot_setting = "در این قسمت تنظیمات مربوط به ربات را انجام دهید. ⚙"

make_button = "لطفا نام دکمه اول از ربات خود را بنویسید"

tanx4takjoy = "از این که رباتساز تکجوی رو انتخاب کردید سپاسگزارم. 🙏 \n لطفا برای ارائه خدمات مد نظر، یکی از گزینه های ذیل را انتخاب فرمایید. 😊"

result_ware_constant = "نتیجه نهایی:"

phname_cancelled = "عکس ثابت موند. تغییر نکرد. 😎"

UNT_Dict = {}

store_is_closed = "فروشگاه بسته شد 🔒"

store_is_open = "فروشگاه باز شد 🔓"

seller_saved_indb = "یوزرنیم فروشنده با موفقیت در پایگاه داده ذخیره شد.حتما از فروشنده بخواهید وارد ربات شده و در این لحظه بر روی یک دکمه کلیک نماید،‌ (مثلا خروج و یا /start) تا ثبت فروشنده تکمیل گردد."

seller_deleted = "این فروشنده با موفقیت از لیست فروشندگان خارج شد."

seller_deletion_cancelled = "فروشنده‌ای از لیست حذف نشد"

createoreditcity4post = "چنانچه قصد اضافه کردن شهری را دارید دکمه افزودن، و چنانچه قصد ویرایش شهری را دارید، دکمه ویرایش را بزنید."

choose_account_setting = "جهت اضافه کردن شماره حساب/شماره کارت بر روی افزودن و جهت حذف شماره کارت، بر روی حذف کلیک کنید."

pay_price = "لطفا مبلغ {price} تومان به یکی از شماره حساب‌های زیر واریز نموده، عکس فیش واریزی را ارسال نمایید.\n در صورت بروز هرگونه مشکل به @XtakjoyX تلگرام کنید"

pay_attention_pay_price = "دقت کنید قبل از پرداخت آیا عابربانک رسید می‌دهد یا خیر. در صورت بروز هر گونه مشکل، به ادمین پی‌ام دهید."

dude_comes = "شخصی با یوزرنیم @{username} وارد ربات @{bot} شد."

witch_bot = "توکن کدام ربات را می‌خواهید تغییر دهید؟"
